# ExistsForSelectedElement Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ConnectorFailures..::..ExistsForSelectedElement Property
BuiltInFailures..::..ConnectorFailures Class See Also
---
Connections already exists for selected element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ExistsForSelectedElement { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ExistsForSelectedElement As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ExistsForSelectedElement {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ConnectorFailures Class
Autodesk.Revit.DB Namespace